# this file must be UTF-8 encoded
######################################################################
#
# English Language text and icon macros 
# -- this file contains text that is of less importance
######################################################################


######################################################################
# 'home' page
package home
######################################################################

#------------------------------------------------------------
# text macros
#------------------------------------------------------------



































######################################################################
# home help page
package homehelp
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------









######################################################################
# external link package
package extlink
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------








# should have arguments of collection, collectionname and link



######################################################################
# authentication page
package authen
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------



















######################################################################
# 'docs' page 
package docs
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------











######################################################################
# collectoraction
package wizard
































######################################################################
# collectoraction
package collector
######################################################################



#------------------------------------------------------------
# text macros
#------------------------------------------------------------









































































_documents_ [l=ur] {مسودات}
_lastupdate_ [l=ur] {آخری بار اپ ڈیٹ کیا گیا}
_ago_ [l=ur] {دن پہلے}
_colnotbuilt_ [l=ur] {مجموعہ نہیں بن سکا}

### taken from here








_textdescrselcol_ [l=ur] {ایک مجموعہ کو منتخب کریں}


######################################################################
# home help page
package homehelp
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_text4buts_ [l=ur] {صفحہ اول پر چار مزید بٹن ہیں}

_textnocollections_ [l=ur] {<p>اس گرین سٹون انسٹالیشن میں فی الحال کوئی مجموعہ موجود نہیں۔ نیا مجموعہ بنانے کیلئے
<ul><li>Use <a href="_httppagecollector_">The Collector</a> to build new collections
    <li>If you have a Greenstone cd-rom you may install collections from cd-rom
</ul>
}

_text1coll_ [l=ur] {اس گرین سٹون لائبریری کی انسٹالیشن میں ایک مجموعہ ہے}

_textmorecolls_ [l=ur] {اس گرین سٹون لائبریری کی انسٹالیشن میں ایک _1_ مجموعی ہے}

######################################################################
# external link package
package extlink
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textextlink_ [l=ur] {بیرونی لنک}
_textlinknotfound_ [l=ur] {اندرونی لنک نہیں مل سکا}





# should have arguments of collection, collectionname and link



######################################################################
# authentication page
package authen
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textGSDLtitle_ [l=ur] {گرین سٹون ڈیجیٹل لائبریری}

_textusername_ [l=ur] {صارف کا نام}
_textpassword_ [l=ur] {خفیہ کوڈ}

_textmustbelongtogroup_ [l=ur] {یاد رکھیے کہ آپ کو اس صفحہ تک رسائی کے لیے"_cgiargug_" گروپ کا ممبر ہونا لازمی ہے}

_textmessageinvalid_ [l=ur] {جو صفحہ آپ کھولنا چاہتے ہیں اس کے لیے آپ کو لاگ ان کرنا پڑے گا<br>
_If_(_cgiargug_,[_textmustbelongtogroup_]<br>)
براہ کرم گرین سٹون کا صارف نام اور خفیہ کوڈ مہیا کریں.}

_textmessagefailed_ [l=ur] {آپ کا صارف نام یا خفیہ کوڈ غلط ہے}

_textmessagedisabled_ [l=ur] {ہم معذرت خواہ ہیں کہ آپ کا اکاونٹ بند کر دیا گیا ہے، براہ مہربانی ویب ماسٹر سے رابطہ کریں}

_textmessagepermissiondenied_ [l=ur] {ہم معذرت خواہ ہیں کہ آپ اس صفحہ تک رسائی حاصل نہیں کر سکتے}

_textmessagestalekey_ [l=ur] {جو لنک آپ نے کھولا ہے یہ اب مہیا نہیں ہے اس صفحہ کی رسائی کے لیئے براہ کرم اپنا خفیہ کوڈ داخل کریں}


######################################################################
# 'docs' page 
package docs
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------



_textuserguide_ [l=ur] {رہنمائے صارف}
_textinstallerguide_ [l=ur] {انسٹال کرنے والے کی رہنمائی}
_textdeveloperguide_ [l=ur] {رہنمائے ڈویلپر}
_textpaperguide_ [l=ur] {کاغذ سے مجموعہ تک}
_textorganizerguide_ [l=ur] {آرگنائزر کا استعمال}

_textgsdocstitle_ [l=ur] {گرین سٹون کی ڈاکومینٹیشن}

######################################################################
# collectoraction
package wizard

_textbild_ [l=ur] {مجموعہ بنائیں}


















_textseconds_ [l=ur] {سیکنڈز}











######################################################################
# collectoraction
package collector
######################################################################



#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textdefaultstructure_ [l=ur] {بنیادی ساخت}
_textmore_ [l=ur] {مزید}
_textinfo_ [l=ur] {مجموعہ کے بارے میں معلومات}

_textconf_ [l=ur] {مجموعی کی ترکیب}
_textdel_ [l=ur] {مجموعہ کو ڈیلیٹ کریں}
_textexpt_ [l=ur] {مجموعہ کو برآمد کریں}

_textdownloadingfiles_ [l=ur] {فائلز ڈائون لوڈ ہو رہی ہیں}
_textimportingcollection_ [l=ur] {مجموعہ کو درآمد کریں}
_textbuildingcollection_ [l=ur] {مجموعہ بلڈ ہو رہا ہے۔۔۔۔}
_textcreatingcollection_ [l=ur] {مجموعہ بنایا جا رہا ہے}



_textcb1_ [l=ur] {کلیکٹر نئے مجموعہ جات بنانے یا پہلے سے موجود مجموعہ جات میں تبدیلی، یا ان کو ڈیلیٹ کرنے کے لیے مدد فراہم کرتا ہے۔ ایسا کرنے کے لیے آپ کو ترتیب وارمدد فراہم کی جائے گی}

_textcb2_ [l=ur] {پہلے، آپ کو فیصلہ کرنا ہے کہ آیا}
_textcnc_ [l=ur] {ایک نیا مجموعہ بنائیے}


_textcb3_ [l=ur] {ڈیجیٹل لائبریری بنانے یا تبدیلی کرنے کیلئے آپ کو لاگ ان ہونا پڑے گا۔ یہ اقدام آپ کے کمپیوٹر کو محفوظ بنانے کے لئے ضروری ہے تاکہ کوئی اور آپ کے کمپیوٹر میں لاگ ان ہو کر آپ کی معلومات میں تبدیلی نہ کر سکے۔  آپ کو محفوظ بنانے کے لیے ہر ۳۰ منٹ کے بعد آپ کو لاگ آوٹ کر دیا جائے گا اگر اس دوران آپ کا کمپوٹر فارغ حالت میں رہا۔ براہ کرم پریشان مت ہوں کیونکہ آپ دوبارہ لاگ ان ہونے کے بعد اپنا کام وہیں سے شروٰع کر سکیں گے جہان آپ نے چھوڑا تھا۔}

_textcb4_ [l=ur] {براہ کرم اپنا گرین سٹون صارف نام اور خفیہ کوڈ داخل کریں اور لاگ ان کا بٹن دبائیں}

_textfsc_ [l=ur] {پہلے اس مجموعہ کو منتخب کریں جس پر آپ کام کرنا چاہتے ہیں (پہلے سے محفوظ شدہ مجموعہ جات اس فہرست میں نظر نہیں آ رہے)}

_textwtc_ [l=ur] {جو مجموعہ آپ نے منتخب کیا ہے اس کے ساتھ آپ مدرجہ ذیل امور کر سکتے ہیں}
_textamd_ [l=ur] {اور مواد ڈالیں اور مجموعہ کو دوبارہ بلڈ کریں}
_textetc_ [l=ur] {مجموعہ کی کنفگریشن فائل کو تبدیل کریں اور مجموعہ کو دوبارہ بنائیں}
_textdtc_ [l=ur] {تمام مجموعہ کو ڈیلیٹ کریں}
_textetcfcd_ [l=ur] {مجموعہ کو خود کا انسٹال ہونے والی سی ڈی روم پر منتقل کریں}
_textcaec_ [l=ur] {پہلے سے موجود مجموعہ کو تبدیل کریں}
_textnwec_ [l=ur] {تبدیلی کیے جانے کے لائق مجموعہ جات مہیا نہیں ہیں}
_textcianc_ [l=ur] {ایک نیا مجموعہ بنایا جا رہا ہے}
_texttsosn_ [l=ur] {نیا لائبریری مجموعہ بنانے کے لیے ان اقدامات کی ضرورت ہے:}
_textsin_ [l=ur] {اس کا نام واضح کریں (اور متعلقہ معلومات)}
_textswts_ [l=ur] {جہاں سے مواد لیا گیا اس ماخظ کا نام دیں}

_textbtc_ [l=ur] {مجموعہ کو "بلڈ" کریں (نیچے دیکھیں)}








_textcnmbs_ [l=ur] {مجموعہ کا نام ضرور مہیا کیا جائے}
_texteambs_ [l=ur] {ای میل کا پتہ ضرور مہیا کیا جائے}
_textpsea_ [l=ur] {براہ کرم ای میل ایڈریس دی گئی مثال کے مطابق مہیا کریں: username@domain}
_textdocmbs_ [l=ur] {مجموعہ کے بارے میں تعارف ضرور لکھا جائے}



_texttfc_ [l=ur] {مجموعہ کا عنوان:}

_texttctiasp_ [l=ur] {مجموعہ کا عنوان ایک مختصر سا لفظ ہے جو پوری ڈیجیٹل لائبریری میں شناخت کے لیئے استعمال ہوتا ہے۔ عنوان کی مثالیں یہ ہو سکتی ہیں: "Computer Science Technical Reports, Humanity Development Library"}

_textcea_ [l=ur] {رابطہ ای میل کا پتہ:}

_textteas_ [l=ur] {یہ ای میل ایڈریس موجودہ مجموعہ کے پہلے رابطے کے طور پر استعمال کیا جائے گا۔  اگر گرین سٹون سافٹ وئرکو کوئی مسئلہ درپیش ہو تو مسئلہ کے حل کی تجاویز پر مشتمل ایک رپورٹ اس ای میل پر بھیجی جائیگی۔ اپنا مکمل ای میل ایڈریس مندرجہ ذیل نمونہ کے مطابق داخل کریں: </tt>name@domain<tt>}

_textatc_ [l=ur] {مجموعہ کے بارے میں:}



_textypits_ [l=ur] {آپ کی پوزیشن کا تعین درج ذیل تیرکے نشان سے ھوتاھے َََََََ اس وقت آپ کی سامنے"ذخیرہ کیمتعلق معلومات ھین"   }





_textbtco_ [l=ur] {مجموعہ کی بنیاد رکھیں مندرجہ ذیل پر}
_textand_ [l=ur] {نیا مواد ڈالیں}
_textad_ [l=ur] {مواد جمع کرتے ہوئے:}



_textis_ [l=ur] {ان پٹ کے ذرائع}







_textreset_ [l=ur] {ری سیٹ}


_texttryagain_ [l=ur] {براہ کرم<a href="_httppagecollector_" target=_top>restart the collector</a>  اور دوبارﷺ کوشش کرین}


_textretcoll_ [l=ur] {کلکٹر پر واپس جائیں}



_textdelinv_ [l=ur] {مجموعہ _cgiargbc1dirname_ محفوظ شدہ حالت میں ہے۔ اس لیے ڈیلیٹ نہیں کیا جا سکتا}

_textdelsuc_ [l=ur] {مجموعہ _cgiargbc1dirname_ کامیابی سے ڈیلیٹ ہو گیا ہے}



_textcolerr_ [l=ur] {کلیکٹر کی غلطی}





_textnocontent_ [l=ur] {مجموعہ کی غلطی: نیے مجموعہ کا نام مہیا نہیں کیا گیا۔ براہ کرم کلیکٹر کو دوبارہ شروع کریں}

_textrestart_ [l=ur] {کلیلٹر کو دوبارہ شروع کریں}

_textreloaderror_ [l=ur] {نیا مجموعہ بناتے وقت ایک غلطی ہو چکی ہے۔ یہ شاید آپ کے براوزر کے ری لوڈ یا بیک بٹن دب جانے سے گرین سٹون الجھن کا شکار ہوا۔ براہ کرم مجموعہ کی تخلیق کے عمل کے دوران یہ بٹن دبانے سے پرہیز کریں۔  آپ کو یہ تجویز کیا جاتا ہے کہ مجموعہ کو دوبارہ تخلیق کریں}





######################################################################
# depositoraction
package depositor
######################################################################


_textdepositorblurb_ [l=ur] {<p>براہ کرم درج ذیل فائل کی معلومات ڈالیں اور _textintro_ پر کلک کریں </p>}

_textcaec_ [l=ur] {پہلے سے موجود مجموعہ میں ڈالیں}
_textbild_ [l=ur] {آئٹم ڈالیں}
_textintro_ [l=ur] {فائل کو سیلیکٹ کریں}
_textconfirm_ [l=ur] {تصدیق}
_textselect_ [l=ur] {مجموعہ کو سیلیکٹ کریں}
_textmeta_ [l=ur] {میٹا ڈیٹا لگائیں}
_textselectoption_ [l=ur] {مجموعہ کو سیلیکٹ کریں۔۔۔}

_texttryagain_ [l=ur] {براہ کرم ڈیپازیٹر کو <a href="_httppagedepositor_" target=_top> ری سٹارٹ </a> کریں اور دوبارہ کوشش کریں}

_textselectcol_ [l=ur] {جس مجموعہ میں نئے مسودات ڈالنا چاہتے ہیں اس کو سیلیکٹ کریں}
_textfilename_ [l=ur] {فائل کا نام}
_textfilesize_ [l=ur] {فائل سائز}

_textretcoll_ [l=ur] {ڈیپازیٹر پر واپس جائیں}


_texttmpfail_ [l=ur] {ڈیپازیٹر عارضی فائلوں سے ڈیٹا پڑھنے اور لکھنے سے قاصر ہے۔ ممکنہ وجوہا ت درج ذیل ہو سکتی ہیں:
<ul>
<li>گرین سٹون کے پاس _gsdlhome_/tmp میں پڑھنے اور لکھنے کے حقوق موجود نہیں ہیں 
</ul>}


######################################################################
# 'gsdl' page
package gsdl
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------


_textgreenstone1_ [l=ur] {گرین سٹون ایک سافٹ ویئر کا مجموعہ ہے جو بہت ساری ڈیجیٹل لائبریری مجموعہ جات بنانے کی صلاحیت رکھتاہے۔  یہ معلومات کی ترتیب و تنظیم کا جدید نظام مہیا کرتا ہے۔ جس سے معلومات کو انٹرنیٹ یا سی ڈی روم پر محفوظ کیا جا سکے۔  گرین سٹون سافٹ ویئر کو نیو زی لینڈ ڈیجیٹل لائبریری پراجیکٹ کے تحت یونیورسٹی آف ویکیٹو نے یونیسکو اور غیر سرکاری تنظیم ہیومین انفو کے تعاون سے بنایا ہے۔ یہ ایک اوپن سورس سافٹ ویئر ہے اور اس کو  <i>http://greenstone.org</i> سےجی این یو جنرل پبلک لائسنس کے تحت ڈائون لوڈ کیا جا سکتا ہے}



_textplatformtitle_ [l=ur] {پلیٹ فارم}




_textcustomisationtitle_ [l=ur] {کسٹمائزیشن}


_textdocumentationtitle_ [l=ur] {ڈاکومینٹیشن}
_textdocuments_ [l=ur] {گرین سٹون سافٹ وئر کے بارے میں تفصیلی مدد کے دستورالعمل موجود ہیں}

#_textthreedocs_ {There are three documents that explain the Greenstone system:}
#_textinstall_ {The Greenstone Digital Library Software Installer's Guide}
#_textuser_ {The Greenstone Digital Library Software User's Guide}
#_textdevelop_ {The Greenstone Digital Library Software Developer's Guide}

_textmailinglisttitle_ [l=ur] {میلنگ لسٹ}


_textbugstitle_ [l=ur] {غلطیاں}


_textgs3title_ [l=ur] {کاموں میں}


_textcreditstitle_ [l=ur] {اعزار}



_textaboutgslong_ [l=ur] {گرین سٹون سافٹ ویئر کے بارے میں}

######################################################################
# 'users' page
package userslistusers
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textlocu_ [l=ur] {موجودہ صارفین کی فہرست}
_textuser_ [l=ur] {صارف}
_textas_ [l=ur] {کھاتے کی صورتحال}
_textgroups_ [l=ur] {گروپس}
_textcomment_ [l=ur] {تبصرہ}
_textadduser_ [l=ur] {نیا صارف بنائیں}
_textedituser_ [l=ur] {تبدیلی کریں}
_textdeleteuser_ [l=ur] {ڈیلیٹ}


######################################################################
# 'users' page
package usersedituser
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------


_textedituser_ [l=ur] {صارف کی معلومات کو تبدیل کریں}
_textadduser_ [l=ur] {نیا صارف بنائیں}





_textoldpass_ [l=ur] {اگر اس فیلڈ کو خالی چھوڑ دیں تو پرانا خفیہ کوڈ ہی رہے گا}
_textenabled_ [l=ur] {چالو}
_textdisabled_ [l=ur] {غیر چالو}

_textaboutgroups_ [l=ur] {گروپس کاما سے الگ کی ہوئی ناموں کی ایک فہرست ہے۔ براہ کرم درمیان میں جگہ نہ چھوڑیں}



######################################################################
# 'users' page
package usersdeleteuser
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textdeleteuser_ [l=ur] {صارف کو ڈیلیٹ کریں}
_textremwarn_ [l=ur] {کیا آپ حقیقتا <b>_cgiargumun_</b>? کو مکمل طور پر ختم کرنا چاہتے ہیں؟}


######################################################################
# 'users' page
package userschangepasswd
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textchangepw_ [l=ur] {خفیہ کوڈ تبدیل کریں}
_textoldpw_ [l=ur] {پرانا خفیہ کوڈ}
_textnewpw_ [l=ur] {نیا خفیہ کوڈ}
_textretype_ [l=ur] {نیا خفیہ کوڈ دوبارہ ٹائپ کریں}


######################################################################
# 'users' page
package userschangepasswdok
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textsuccess_ [l=ur] {آپ کا خفیہ کوڈ کامیابی سے تبدیل ہو گیا ہے}


######################################################################
# 'users' page
package users
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textinvalidusername_ [l=ur] {صارف نام نامنظور}
_textinvalidpassword_ [l=ur] {خفیہ کوڈ نامنظور}
_textemptypassword_ [l=ur] {اس صارف کیلئے ابتدائی خفیہ کوڈ ڈالیں}
_textuserexists_ [l=ur] {یہ صارف پہلے سے موجود ہے، کوئی نیا صارف نام ڈالیں}

_textusernameempty_ [l=ur] {براہ کرم اپنا صارف نام ڈالیں}
_textpasswordempty_ [l=ur] {آپ کو اپنا پرانا خفیہ کوڈ ضرور ڈالنا پڑے گا}
_textnewpass1empty_ [l=ur] {اپنا نیا خفیہ کوڈ ڈالیں اور دوبارہ ٹائپ کریں}
_textnewpassmismatch_ [l=ur] {آپ کے دونوں خفیہ کوڈ ایک جیسے نہیں ہیں}
_textnewinvalidpassword_ [l=ur] {آپ نے غلط خفیہ کوڈ ڈالا}
_textfailed_ [l=ur] {آپ کا صارف نام یا خفیہ کوڈ غلط تھا}


######################################################################
# 'status' pages
package status
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------


_textversion_ [l=ur] {گرین سٹون ورژن نمبر}
_textframebrowser_ [l=ur] {اس کو دیکھنے کیلئے آپ کے براوزر میں فریمز چالو ہونا ضروری ہیں}
_textusermanage_ [l=ur] {صارفین کا انتظام و انصرام}
_textlistusers_ [l=ur] {فہرست صارف}
_textaddusers_ [l=ur] {ایک نیا صارف بنائیں}
_textchangepasswd_ [l=ur] {اپنا خفیہ کوڈ تبدیل کریں}
_textinfo_ [l=ur] {تکنیکی معلومات}
_textgeneral_ [l=ur] {عام}
_textarguments_ [l=ur] {آرگومینٹس}

_textbrowsers_ [l=ur] {براوزرز}
_textprotocols_ [l=ur] {پروٹوکولز}
_textconfigfiles_ [l=ur] {کنفگریشن فائلرز}

_textusagelog_ [l=ur] {استعمال کا رکارڈ}
_textinitlog_ [l=ur] {ابتدائی رکارڈ}
_texterrorlog_ [l=ur] {غلطی کا رکارڈ}
_textadminhome_ [l=ur] {ایڈمن کا صفحہ اول}
_textreturnhome_ [l=ur] {گرین سٹون کا صفحہ اول}
_titlewelcome_ [l=ur] {انتظامیہ}

_textvol_ [l=ur] {آن لائن رکارڈز دیکھیں}
_textcmuc_ [l=ur] {مجموعی بنائیں، صحیح حالت میں رکھیں اور اپ ڈیٹ کریں}
_textati_ [l=ur] {تکنیکی معلومات کو حاصل کریں جیسے کہ سی جی آئی آرگومینٹس}

_texttsaa_ [l=ur] {یہ تمام خدمات کو استعمال کرنے کیلئے}

_textcolstat_ [l=ur] {مجموعہ کی صورتحال}



_textcafi_ [l=ur] {کسی مجموعہ کی معلومات جاننے کے لئے <i> مخفف </i>پر کلک کریں}
_textcctv_ [l=ur] {مجموعہ کو دیکھنے کے لئے <i>مجموعہ</i>پر کلک کریں}
_textsubc_ [l=ur] {تبدیلیاں داخل کریں}
_texteom_ [l=ur] {main.cfg کھولنے میں غلطی}
_textftum_ [l=ur] {main.cfg اپڈیٹ کرنے میں ناکامی}
_textmus_ [l=ur] {main.cfg اپڈیٹ کرنے میں کامیابی}


######################################################################
# 'bsummary' pages
package bsummary
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------

_textbsummary_ [l=ur] {_collectionname_ کی بلڈ سمری}
_textflog_ [l=ur] {فیل لاگ برائے "_collectionname_" کلیکشن}
_textilog_ [l=ur] {امپورٹ لاگ برائے "_collectionname_" کلیکشن}

############################################################################
#
# This stuff is only used by the usability (SEND FEEDBACK) stuff
#
############################################################################
package Global

# old cusab button
_linktextusab_ [l=ur] {اپنی رائے بھیجیں}

_greenstoneusabilitytext_ [l=ur] {گرین کا استعمال}

_textwhy_ [l=ur] {<p>اس رپورٹ کو بھیجنے کا ایک استعمال یہ ہے کہ آپ یہ ظاہر کر دیں کہ آ کو یہ صفحہ دیکھنے میں دشواری کا سامنا ہے}
_textextraforform_ [l=ur] {آپ کو فارم پر کرنے کی ضرورت نہیں ۔ کوِئی بھی معلومات مدد گار فراہم ہو گی}
_textprivacybasic_ [l=ur] {<p> یہ رپورٹ صرف اس معلومات پر مشتمل ہو گی جو گرین سٹون کے صفحہ پر آپ دیکھ رہے تھے، اور جو  ٹیکنالوجی آپ استعمال کر رہے تھے}
_textstillsend_ [l=ur] {کیا آپ ابھی بھی یہ رپورٹ بھیجنا چاھتے ہیں}

_texterror_ [l=ur] {غلطی}
_textyes_ [l=ur] {جی}
_textno_ [l=ur] {نہیں}
_textclosewindow_ [l=ur] {ونڈو کو بند کر دیں}
_textabout_ [l=ur] {کے بارے میں}
_textprivacy_ [l=ur] {رازداری}
_textsend_ [l=ur] {بھیجنا}
_textdontsend_ [l=ur] {نہ بھیجیں}
_textoptionally_ [l=ur] {اختیاری طور پر}

_textunderdev_ [l=ur] {تفصیلی منظر فائنل ورژن میں دیکھا جا سکے گا}

_textviewdetails_ [l=ur] {رپورٹ کی تفصیل دیکھیں}
_textmoredetails_ [l=ur] {زیادہ تفصیلات}
_texttrackreport_ [l=ur] {اس رپورٹ پر نظر رکھیں}
_textcharacterise_ [l=ur] {یہ کس قسم کا مسئلہ ہے}
_textseverity_ [l=ur] {مسئلہ کتنا برا ہے}
 
_textbadrender_ [l=ur] {یہ صفحہ عجیب نظر آ رہا ہے}
_textcontenterror_ [l=ur] {مواد کی غلطی}
_textstrangebehaviour_ [l=ur] {عجیب رویہ}
_textunexpected_ [l=ur] {کچھ غیر متوقع ہوا}
_textfunctionality_ [l=ur] {استعمال کرنا مشکل ہے}
_textother_ [l=ur] {دوسرا}

_textcritical_ [l=ur] {گھمبیر}
_textmajor_ [l=ur] {سنجیدہ}
_textmedium_ [l=ur] {درمیانہ}
_textminor_ [l=ur] {معمولی}
_texttrivial_ [l=ur] {ٹریویل}

_textwhatdoing_ [l=ur] {آپ کیا کرنے کی کوشش کر رہے تھے ؟}
_textwhatexpected_ [l=ur] {آپ کیا ہونے کی توقع رکھتے تھے ؟}
_textwhathappened_ [l=ur] {حقیقتا کیا ہوا؟}

_cannotfindcgierror_ [l=ur] {<h2>معذرت</h2>بٹن کے لیے سرور پروگرام نہیں مل سکا "_linktextusab_"}

_textusabbanner_ [l=ur] {گرین سٹون کا کورو بینر}


######################################################################
# GTI text strings
package gti
######################################################################


#------------------------------------------------------------
# text macros
#------------------------------------------------------------
	
_textgtierror_ [l=ur] {کوئی غلطی ہو چکی ہے}



_textgtiselecttlc_ [l=ur] {براہ کرم اپنی زبان منتخب کریں}

#for status page
_textgtiviewstatus_ [l=ur] {تمام زبانوں کے تراجم کی کیفیت جاننے کیلئے کلک کریں}
_textgtiviewstatusbutton_ [l=ur] {سٹیٹس دیکھیں}
_textgtistatustable_ [l=ur] {تمام زبانوں کے تجمہ کی صورتحال کی فہرست}
_textgtilanguage_ [l=ur] {زبان}
_textgtitotalnumberoftranslations_ [l=ur] {تراجم کی تعداد}

_textgtiselecttfk_ [l=ur] {براہ کرم اس فائل لو منتخب کریں جس پر آپ کام کرنا چاہتے ہیں}

_textgticoredm_ [l=ur] {گرین سٹون انٹرفیس (کور)}
_textgtiauxdm_ [l=ur] {گرین سٹون انٹرفیس (آکزلری)}
_textgtiglidict_ [l=ur] {جی ایل آئی لغت}
_textgtiglihelp_ [l=ur] {جی ایل آئی کے بارے میں مدد}
_textgtiperlmodules_ [l=ur] {پرل ماڈیولز}

_textgtigreenorg_ [l=ur] {greenstone.org}
_textgtigs3interface_ [l=ur] {گرین سٹون ۳ انٹرفیس}

#for greenstone manuals
_textgtidevmanual_ [l=ur] {دستورالعمل برائے ڈیویلپر}
_textgtiinstallmanual_ [l=ur] {دستورالعمل برائے گرین سٹون انسٹالر}
_textgtipapermanual_ [l=ur] {گرین سٹون دستورالعمل برائے کاغذ سے مجموعہ تک}
_textgtiusermanual_ [l=ur] {دستورالعمل برائے گرین سٹون صارف}

_textgtienter_ [l=ur] {داخل کریں}

_textgticorrectexistingtranslations_ [l=ur] {پہلے سے موجود ترجمہ کو ٹھیک کریں}
_textgtidownloadtargetfile_ [l=ur] {فائل کو ڈاون لوڈ کریں}
_textgtiviewtargetfileinaction_ [l=ur] {اس فائل کو کام کرتے ہوئے دیکھیں}
_textgtitranslatefileoffline_ [l=ur] {اس فائل کا آف لائن ترجمہ کریں}



_textgtinumchunkstranslated_ [l=ur] {تراجم کر دے گئے ہیں}
_textgtinumchunksrequiringupdating_ [l=ur] {ان میں سے _1_ کو اپ ڈیٹ کرنے کی ضرورت ہے}
_textgtinumchunksrequiringtranslation_ [l=ur] {ترجمہ جو ابھی رہتا ہے}

#for status page
_textgtinumchunkstranslated2_ [l=ur] {تراجم کی تعداد جو مکمل ہو چکے}
_textgtinumchunksrequiringupdating2_ [l=ur] {تراجم کی تعداد جن کو اپ ڈیٹ کرنے کی ضرورت ہے}
_textgtinumchunksrequiringtranslation2_ [l=ur] {تراجم کی تعداد جو ابھی واجب ہیں}

_textgtienterquery_ [l=ur] {جس ٹیکسٹ کو آپ درست کرنا چاہتے ہیں اس میں سے کوئی لفظ یا پیرا لکھیں}
_textgtifind_ [l=ur] {ڈھونڈ}

_textgtitranslatingchunk_ [l=ur] {پورے مواد میں سے <i>_1_</i> کا ترجمہ کیا جا رہا ہے}
_textgtiupdatingchunk_ [l=ur] {ٹیکسٹ کے اس حصے کو اپ ڈیٹ کیا جا رہا ہے}
_textgtisubmit_ [l=ur] {جمع کریں}

_textgtilastupdated_ [l=ur] {آخری اپ ڈیٹ}

_textgtitranslationfilecomplete_ [l=ur] {اس فائل کو اپ ڈیٹ کرنے کا شکریہ۔۔ یہ اب مکمل ہے <p> آپ اس کی ایک کاپی مندرجہ بالا لنک سے ڈاون لوڈ کر سکتے ہیں۔ اور یہ مستقبل میں گرین سٹون کی ریلیز میں شامل ہو گی}





############
# gli page
############
package gli

_textglilong_ [l=ur] {گرین سٹون لائبریرین انٹرفیس}

